#### Terraform Format and Style 🖌success
#### Terraform Initialization ⚙️success
#### Terraform Validation 🤖success
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.

```
</details>

#### Terraform Plan 📖success
<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
data.google_service_account.terraform_sa: Reading...
module.enable_google_apis.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iamcredentials.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iam.googleapis.com]
google_service_account.invoker: Refreshing state... [id=projects/youtube-data-api-385206/serviceAccounts/103621406525233832376]
module.enable_google_apis.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/sts.googleapis.com]
google_iam_workload_identity_pool.youtube_data_api_pool: Refreshing state... [id=projects/youtube-data-api-385206/locations/global/workloadIdentityPools/youtube-data-api-pool]
google_service_account.app: Refreshing state... [id=projects/youtube-data-api-385206/serviceAccounts/116976706981047405681]
google_project_iam_member.app[0]: Refreshing state... [id=youtube-data-api-385206/roles/bigquery.jobUser/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[2]: Refreshing state... [id=youtube-data-api-385206/roles/run.serviceAgent/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[4]: Refreshing state... [id=youtube-data-api-385206/roles/storage.objectCreator/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[1]: Refreshing state... [id=youtube-data-api-385206/roles/bigquery.dataEditor/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/youtube-data-api-385206/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[5]: Refreshing state... [id=youtube-data-api-385206/roles/secretmanager.secretAccessor/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[3]: Refreshing state... [id=youtube-data-api-385206/roles/pubsub.publisher/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.invoker: Refreshing state... [id=youtube-data-api-385206/roles/run.invoker/serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.youtube_data_api_provider: Refreshing state... [id=projects/youtube-data-api-385206/locations/global/workloadIdentityPools/youtube-data-api-pool/providers/youtube-data-api-provider]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/youtube-data-api-385206/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/1051886801059/locations/global/workloadIdentityPools/youtube-data-api-pool/attribute.repository/Kamegrueon/youtube_data_api]
module.artifact_registry["stg"].google_artifact_registry_repository.repository: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/repositories/stg-youtube-data-api-repository]
module.artifact_registry["prd"].google_artifact_registry_repository.repository: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/repositories/prd-youtube-data-api-repository]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.artifact_registry["dev"].google_artifact_registry_repository.repository will be created
  + resource "google_artifact_registry_repository" "repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Cloud Run repository for dev-youtube-data-api"
      + effective_labels       = (known after apply)
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "youtube-data-api-385206"
      + repository_id          = "dev-youtube-data-api-repository"
      + terraform_labels       = (known after apply)
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-prerelease"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (2 unchanged attributes hidden)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registory      = {
      + dev = {
          + repository = {
              + cleanup_policies          = [
                  + {
                      + action               = "DELETE"
                      + condition            = [
                          + {
                              + newer_than            = ""
                              + older_than            = ""
                              + package_name_prefixes = []
                              + tag_prefixes          = []
                              + tag_state             = "ANY"
                              + version_name_prefixes = []
                            },
                        ]
                      + id                   = "delete-prerelease"
                      + most_recent_versions = []
                    },
                ]
              + cleanup_policy_dry_run    = false
              + create_time               = (known after apply)
              + description               = "Cloud Run repository for dev-youtube-data-api"
              + docker_config             = []
              + effective_labels          = (known after apply)
              + format                    = "DOCKER"
              + id                        = (known after apply)
              + kms_key_name              = null
              + labels                    = null
              + location                  = "asia-northeast1"
              + maven_config              = []
              + mode                      = "STANDARD_REPOSITORY"
              + name                      = (known after apply)
              + project                   = "youtube-data-api-385206"
              + remote_repository_config  = []
              + repository_id             = "dev-youtube-data-api-repository"
              + terraform_labels          = (known after apply)
              + timeouts                  = null
              + update_time               = (known after apply)
              + virtual_repository_config = []
            }
        }
      ~ stg = {
          ~ repository = {
                id                        = "projects/youtube-data-api-385206/locations/asia-northeast1/repositories/stg-youtube-data-api-repository"
              ~ labels                    = null -> {}
                name                      = "stg-youtube-data-api-repository"
              ~ update_time               = "2024-06-09T00:42:28.858934Z" -> "2024-06-15T07:29:37.123348Z"
                # (17 unchanged attributes hidden)
            }
        }
        # (1 unchanged attribute hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

**Pusher: @Kamegrueon, Action: pull_request, Working Directory: ./terraform/common_stack, Workflow: deploy**
